In [5]:
import pandas as pd
import numpy as np
#https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side
from itertools import chain,cycle
from IPython.display import display, HTML, display_html
display(HTML("<style>.container { width:100% !important; }</style>"))
display(HTML("<style>.output_result { max-width:100% !important; }</style>"))
display(HTML("<style>.prompt { display:none !important; }</style>"))

In [6]:
def dfDisplay(*args,titles=cycle([''])):
    html_str=''
    for df,title in zip(args, chain(titles,cycle(['</br>'])) ):
        html_str+='<th style="text-align:center"><td style="vertical-align:top">'
        html_str+=f'<h2 style="text-align: center;">{title}</h2>'
        html_str+=df.to_html().replace('table','table style="display:inline"')
        html_str+='</td></th>'
    display_html(html_str,raw=True)

<p style="font-size:18pt"> The aim is to show dataframes SIDE BY SIDE, which works on Jupyter Notebook. For some weird reason, they appear one on top of the other here on GitHub. </p>

In [7]:
A = np.random.randn(100, 4)
B = np.random.randn(100, 4)
C = np.random.randn(100, 4)

dfA = pd.DataFrame(A)
dfB = pd.DataFrame(B)
dfC = pd.DataFrame(C)

In [11]:
dfDisplay(dfA.head(),dfB.head(), dfC.head(), titles=['dfA','dfB', 'dfC'])

,0,1,2,3
0,-0.065175,0.015106,-0.515748,0.000562
1,0.758696,-0.416393,-1.379858,-1.458559
2,-0.029647,0.899387,-1.281173,-1.683306
3,0.142912,0.574748,0.326939,1.024053
4,1.374375,0.712984,0.094740,-1.327653
,0,1,2,3
0,0.796141,-0.631295,-0.013663,0.959650
1,-0.633949,0.019039,0.512492,0.548426
2,0.211946,0.109942,-0.640802,0.048357
3,1.470397,-0.487611,-0.679964,-1.072151
4,-0.050847,-2.064037,-1.347000,-0.997551
,0,1,2,3
0,-0.227618,1.265194,0.724224,-1.519187
1,1.271739,1.849562,1.303812,-0.911521
2,0.083944,-1.178815,0.391260,-0.162506
3,-3.082002,-1.003966,-0.110020,-0.037797
4,-0.828296,-2.069940,1.799065,0.186591

In [ ]:
dfDisplay(dfA,dfB, dfC, titles=['dfA','dfB', 'dfC'])

In [26]:
#Display 7 rows
pd.set_option('display.max_rows', 7)
dfA

           0         1         2         3
0  -0.065175  0.015106 -0.515748  0.000562
1   0.758696 -0.416393 -1.379858 -1.458559
2  -0.029647  0.899387 -1.281173 -1.683306
..       ...       ...       ...       ...
97 -0.114200  1.643916 -0.623046  0.110217
98 -0.677517 -0.098474  0.025113  0.502204
99 -0.516820 -0.208446  0.632443 -0.318934

[100 rows x 4 columns]

In [27]:
#Display ALL rows
pd.set_option('display.min_rows', 7)
dfA

           0         1         2         3
0  -0.065175  0.015106 -0.515748  0.000562
1   0.758696 -0.416393 -1.379858 -1.458559
2  -0.029647  0.899387 -1.281173 -1.683306
..       ...       ...       ...       ...
97 -0.114200  1.643916 -0.623046  0.110217
98 -0.677517 -0.098474  0.025113  0.502204
99 -0.516820 -0.208446  0.632443 -0.318934

[100 rows x 4 columns]

In [25]:
pd.set_option('display.min_rows', 8)
dfA

           0         1         2         3
0  -0.065175  0.015106 -0.515748  0.000562
1   0.758696 -0.416393 -1.379858 -1.458559
2  -0.029647  0.899387 -1.281173 -1.683306
..       ...       ...       ...       ...
97 -0.114200  1.643916 -0.623046  0.110217
98 -0.677517 -0.098474  0.025113  0.502204
99 -0.516820 -0.208446  0.632443 -0.318934

[100 rows x 4 columns]